/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/08/20 20:12
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

namespace Iuker.YourSharp.Parser.Ast
{
    /// <summary>
    /// 语法树节点（语句）
    /// </summary>
    public class Statement : SyntaxNode
    {
        /// <summary>
        /// 语法标签
        /// </summary>
        public string LabelSet;
    }
}