/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/08/20 17:52
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

namespace Iuker.YourSharp.Parser.Ast
{
    /// <summary>
    /// 一元操作类型
    /// </summary>
    public enum UnaryOperatorType : byte
    {
        /// <summary>
        /// 加
        /// </summary>
        Plus,

        /// <summary>
        /// 减
        /// </summary>
        Minus,

        //BitwiseNot,
        //LogicalNot,
        //Delete,
        //Void,
        //TypeOf,

        /// <summary>
        /// 自增
        /// </summary>
        Increment,

        /// <summary>
        /// 自减
        /// </summary>
        Decrement,















    }
}