/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/02/28 12:50:17
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Iuker.UnityKit.Run.Module.InputResponse
{
    /// <summary>
    /// 左键点击类型，左键、中键、右键
    /// </summary>
    public enum MouseClickType
    {
        /// <summary>
        /// 左键
        /// </summary>
        Left,

        /// <summary>
        /// 中键
        /// </summary>
        Middle,

        /// <summary>
        /// 右键
        /// </summary>
        Right,
    }
}
