/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/4/4 上午11:09:53
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Iuker.UnityKit.Run.Module.View.MVDA
{
    /// <summary>
    /// 视图行为处理器脚本类型
    /// </summary>
    public enum ViewScriptType
    {
        /// <summary>
        /// 视图生命周期
        /// </summary>
        ViewPipeline,

        /// <summary>
        /// 控件交互行为
        /// </summary>
        WidgetAction,

        /// <summary>
        /// 绘制及动画效果
        /// </summary>
        ViewDraw,

        /// <summary>
        /// 模板
        /// </summary>
        WidgetCell,
    }
}
