/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/06/19 20:57
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

namespace Iuker.UnityKit.Editor.Protobuf
{
    /// <summary>
    /// protobuf字段类型
    /// </summary>
    public enum ProtobufFiledType
    {
        /// <summary>
        /// 可选字段
        /// </summary>
        optional,

        /// <summary>
        /// 必须字段
        /// </summary>
        required,

        /// <summary>
        /// 列表字段
        /// </summary>
        repeated,

    }
}