/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/03/01 11:15:58
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Iuker.UnityKit.Run.Tween
{
    /// <summary>
    /// 手动停止一个动画时可以采取的行为
    /// </summary>
    public enum TweenStopBehavior
    {
        /// <summary>
        /// 不改变当前值
        /// </summary>
        DoNotModify,

        /// <summary>
        /// 使动画立即改变到结束值
        /// </summary>
        Complete
    }
}
