/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/03/01 11:11:32
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Iuker.UnityKit.Run.Tween
{
    /// <summary>
    /// 动画运行状态
    /// </summary>
    public enum TweenState
    {
        /// <summary>
        /// 动画启动
        /// </summary>
        Start,

        /// <summary>
        /// 动画运行中
        /// </summary>
        Running,

        /// <summary>
        /// 动画暂停
        /// </summary>
        Paused,

        /// <summary>
        /// 动画恢复
        /// </summary>
        Resume,

        /// <summary>
        /// 动画停止
        /// </summary>
        Stopped
    }
}
