/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/04/14 12:12:21
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Iuker.MoonSharp.Interpreter.Interop.StandardDescriptors.ReflectionMemberDescriptors
{
    class PropertyMemberDescriptor
    {
    }
}
