/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/08/14 20:18:26
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

using System;
using UnityEngine;

namespace Iuker.UnityKit.Editor.Setting
{
    /// <summary>
    /// Iuker首选项样式
    /// </summary>
    [Serializable]
    public static class IukerSettingStyles
    {
        public static GUIStyle LargeButton = "LargeButton";
    }
}