/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 6/18/2017 11:50
Email: liuruoyu1981@gmail.com
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

using System;

namespace Iuker.UnityKit.Editor.Console.Core
{
    [AttributeUsage(AttributeTargets.Method)]
    public class StackTraceIgnore : Attribute
    {
    }
}