/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/03/12 14:55:37
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

namespace Iuker.Common.Module.Net.Http
{
    /// <summary>
    /// 协议发送方式
    /// </summary>
    public enum ProtocolSendType
    {
        /// <summary>
        /// 普通发送
        /// 发送时需创建遮挡模态窗口
        /// </summary>
        Normal,

        /// <summary>
        /// 静默发送
        /// 发送时无需创建遮挡模态窗口
        /// </summary>
        Silence,



    }
}
