/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/03/16 10:15:28
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Assets.thirdcode.Iuker.MoonSharp
{
    /// <summary>
    /// 这个类包含用来定制脚本对象的行为的设置选项。
    /// </summary>
    public class ScriptOptions
    {
        internal ScriptOptions() { }



        internal ScriptOptions(ScriptOptions defaults)
        {
            
        }









    }
}
