/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/02/27 12:01:10
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Iuker.UnityKit.Run.Base
{
    /// <summary>
    /// unity3d应用运行状态
    /// </summary>
    public enum U3dAppStatus
    {
        /// <summary>
        /// 开始运行
        /// </summary>
        Start,

        /// <summary>
        /// 运行中
        /// </summary>
        Runing,

        /// <summary>
        /// 暂停中
        /// </summary>
        Pause,

        /// <summary>
        /// 处于新手指引下
        /// </summary>
        Guide,



    }
}
