/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/02/27 12:02:40
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Iuker.UnityKit.Run.Base
{
    /// <summary>
    /// unity3d应用运行模式
    /// </summary>
    public enum U3dAppRunMode
    {
        /// <summary>
        /// 开发模式
        /// </summary>
        Develop,

        /// <summary>
        /// 自动测试模式
        /// </summary>
        AutoTest,

        /// <summary>
        /// 正式发布
        /// </summary>
        Publish,
    }
}
