/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/05/20 16:09
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/



namespace Iuker.YourSharp.Common.Types
{
    /// <summary>
    /// 访问权限类型。
    /// </summary>
    public enum AccessType
    {
        None,

        Private = 101,

        Protected,

        Public,

        Internal,
    }
}
