/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/07/25 15:35:40
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

using System;

namespace Iuker.UnityKit.Run.Base.Config
{
    /// <summary>
    /// 客户端开发者
    /// </summary>
    [Serializable]
    public class ClientCoder
    {
        /// <summary>
        /// 开发者姓名
        /// </summary>
        public string Name;

        /// <summary>
        /// 开发者邮箱
        /// </summary>
        public string Email;

    }
}