/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/04/20 22:45:07
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

using System;

namespace Iuker.UnityKit.Run.Base.Config
{
    [Serializable]
    public class Scene
    {
        public string SceneId = "SceneId";

        public string AssetName = "AssetName";




    }
}
