/***********************************************************************************************
Author：liuruoyu1981
CreateDate: 2017/08/20 17:32
Email: 35490136@qq.com
QQCode: 35490136
CreateNote: 
***********************************************************************************************/


/****************************************修改日志***********************************************
1. 修改日期： 修改人： 修改内容：
2. 修改日期： 修改人： 修改内容：
3. 修改日期： 修改人： 修改内容：
4. 修改日期： 修改人： 修改内容：
5. 修改日期： 修改人： 修改内容：
****************************************修改日志***********************************************/

namespace Iuker.YourSharp
{
    public static class TestCode
    {
        /// <summary>
        /// 测试代码
        /// </summary>
        private static string code = @"
namespace MySharp.Common.Test

    class MyClass
    
        void MyTest(int a, int b = 100)
            int c = a + b   // this is single quote!
            int d = c++ 
        over
";











    }
}